UNF_KlK.КИТ_ДОК/src/Documents/ОтчетПроизводстваЗаСменуОкорка/ОтчетПроизводстваЗаСменуОкорка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетПроизводстваЗаСменуОкорка</name>
  <registerRecords>AccumulationRegister.ДвижениеПоПроизводству</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетПроизводстваУНФ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентКоры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентСырья</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураКора</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗамерыРучнойУчет</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Диаметр</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоШтук</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.ШтабелиKIT</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сырье</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.ШтабелиKIT</types>
      </type>
    </attributes>
    <attributes>
      <name>СкладСырья</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UNF_KlK.КИТ_ДОК/src/Documents/ОтчетПроизводстваЗаСменуОкорка/ManagerModule.bsl
#Область ИнтерфейсПечати

Функция ОписатьПравилаЗаполненияПодписей() Экспорт
	
	РеквизитыОбъекта = Новый Соответствие;
	
	РеквизитыОбъекта.Вставить("ПодписьРуководителя", "Организация.ПодписьРуководителя");
	РеквизитыОбъекта.Вставить("ПодписьКладовщика", "СтруктурнаяЕдиница.ПодписьМОЛ");
	РеквизитыОбъекта.Вставить("Комиссия", "ЭтоКомиссия");
	
	Возврат РеквизитыОбъекта;
	
КонецФункции

// Функция формирует печатную форму документа по указанному макету.
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент в который будет выводится печатная
//				   форма.
//  ИмяМакета    - Строка, имя макета печатной формы.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	Перем Ошибки;
	
	ПараметрыНоменклатуры = Новый Структура;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ОтчетПроизводстваЗаСменуОкорка";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "РеестрВыборотки" Тогда
			ПечатьПростаяФорма(ТабличныйДокумент, ТекущийДокумент);
					
			
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрВыборотки") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрВыборотки", НСтр("ru = 'Реестр выборотки'"), ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "РеестрВыборотки"));
		
	КонецЕсли;
	
	
	// параметры отправки печатных форм по электронной почте
	ЭлектроннаяПочтаУНФ.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов,
		КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрВыборотки";
	КомандаПечати.Представление = НСтр("ru = 'Реестр выборотки'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;
//	
//	КомандаПечати = КомандыПечати.Добавить();
//	КомандаПечати.Идентификатор = "ТОРГ4";
//	КомандаПечати.Представление = НСтр("ru = 'ТОРГ4 (Акт о приемке товара)'");
//	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
//	КомандаПечати.Порядок = 4;
//	
//	КомандаПечати = КомандыПечати.Добавить();
//	КомандаПечати.Идентификатор = "ПриходныйОрдер";
//	КомандаПечати.Представление = НСтр("ru = 'Приходный ордер'");
//	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
//	КомандаПечати.Порядок = 7;
//	
//	КомандаПечати = КомандыПечати.Добавить();
//	КомандаПечати.Идентификатор = "БланкТоварногоНаполнения";
//	КомандаПечати.Представление = Обработки.ПечатьБланкТоварногоНаполнения.ПредставлениеПФ();
//	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
//	КомандаПечати.Порядок = 10;
	
КонецПроцедуры

#КонецОбласти


// Процедура заполняет табличный документ для печати.
//
// Параметры:
//	ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//	Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура ПечатьПростаяФорма(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ОтчетПроизводстваЗаСменуОкорка.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ОтчетПроизводстваЗаСменуОкорка.Номер,
		|	ОтчетПроизводстваЗаСменуОкорка.Дата,
		|	ОтчетПроизводстваЗаСменуОкорка.Организация,
		|	ОтчетПроизводстваЗаСменуОкорка.Склад,
		|	ОтчетПроизводстваЗаСменуОкорка.Подразделение,
		|	ОтчетПроизводстваЗаСменуОкорка.Автор,
		|	ОтчетПроизводстваЗаСменуОкорка.ДатаНачала,
		|	ОтчетПроизводстваЗаСменуОкорка.ДатаОкончания,
		|	ОтчетПроизводстваЗаСменуОкорка.ПроцентКоры,
		|	ОтчетПроизводстваЗаСменуОкорка.КоэффициентСырья,
		|	ОтчетПроизводстваЗаСменуОкорка.КоличествоКоры,
		|	ОтчетПроизводстваЗаСменуОкорка.ЗамерыРучнойУчет.(
		|		НомерСтроки,
		|		Номенклатура,
		|		Порода,
		|		Диаметр,
		|		Количество,
		|		КоличествоШтук,
		|		ДиаметрЧисло,
		|		Штабель),
		|	ОтчетПроизводстваЗаСменуОкорка.Сырье.(
		|		НомерСтроки,
		|		Номенклатура,
		|		ХарактристикаНоменклатуры,
		|		Количество,
		|		Штабель,
		|		СкладСырья)
		|ИЗ
		|	Документ.ОтчетПроизводстваЗаСменуОкорка КАК ОтчетПроизводстваЗаСменуОкорка
		|ГДЕ
		|	ОтчетПроизводстваЗаСменуОкорка.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗамерыРучнойУчетШапка = Макет.ПолучитьОбласть("ЗамерыРучнойУчетШапка");
	ОбластьЗамерыРучнойУчет = Макет.ПолучитьОбласть("ЗамерыРучнойУчет");ОбластьСырьеШапка = Макет.ПолучитьОбласть("СырьеШапка");
	ОбластьСырье = Макет.ПолучитьОбласть("Сырье");
	

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());	
		ТабДок.Вывести(ОбластьЗамерыРучнойУчетШапка);
		ВыборкаЗамерыРучнойУчет = Выборка.ЗамерыРучнойУчет.Выбрать();
		Пока ВыборкаЗамерыРучнойУчет.Следующий() Цикл
			ОбластьЗамерыРучнойУчет.Параметры.Заполнить(ВыборкаЗамерыРучнойУчет);
			ТабДок.Вывести(ОбластьЗамерыРучнойУчет, ВыборкаЗамерыРучнойУчет.Уровень());
		КонецЦикла;		ТабДок.Вывести(ОбластьСырьеШапка);
		ВыборкаСырье = Выборка.Сырье.Выбрать();
		Пока ВыборкаСырье.Следующий() Цикл
			ОбластьСырье.Параметры.Заполнить(ВыборкаСырье);
			ТабДок.Вывести(ОбластьСырье, ВыборкаСырье.Уровень());
		КонецЦикла;
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
